print ('ВІтаємо вас у калькуляторі Python')
q1 = int (input('Ведіть число 1: '))
q2 = int (input('Ведіть число 2: '))

v = int (input('Яку операцію ви хочете виконати? \n 1 Додавання \n 2 Віднімання \n 3 Ділення \n 4 Множення \n'))

if v == 1:
    r = q1 + q2
    p = 'додавання'
    t = p
if v == 2:
    r = q1 - q2
    l = 'віднімання'
    t = l
if v == 3:
    r = float(q1 / q2)
    m = 'ділення'
    t = m
if v == 4:
    r = q1 * q2
    n = 'множення'
    t = n
print ('Результат ',t,' = ',r)
    